РП/src/Documents/СведенияОКонтролируемыхОперациях/СведенияОКонтролируемыхОперациях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СведенияОКонтролируемыхОперациях</name>
  <registerRecords>AccumulationRegister.ОбщиеСведенияОКонтролируемыхОперациях</registerRecords>
  <registerRecords>AccumulationRegister.КонтролируемыеОперации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперацийЗаПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКонтролируемыхОпераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтролируемыеСделки</name>
    <attributes>
      <name>Контрагент</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИнформационнйБазы</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КодНаименованияОперации</name>
      <comment>Додаток 4 порядку складання звіту про контрольовані операції - 001-036</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСделки</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСделкиСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПредмета</name>
      <comment>Додаток 4 порядку складання звіту про контрольовані операції - 1,2,3</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодКлассификатораПродукцииИУслуг</name>
      <comment>ДК 016:2010, Наказ №457 від 11.10.2010</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУКТВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторУКТВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>КодУКВЭП</name>
      <comment>КЗЕП, Наказ №69 від 27.02.2013</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтракта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКонтракта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтороныОперации</name>
      <comment>Додаток 5 порядку складання звіту про контрольовані операції - 001-045</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтраныПроисхождения</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПоставкиПоИнкотермс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоПоставкиПоИнкотермс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТорговаяМарка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперацииС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперацииПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВалюты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсВалюты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодОснования</name>
      <comment>Додаток 6 порядку складання звіту про контрольовані операції - 201-206</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМетода</name>
      <comment>Додаток 7 порядку складання звіту про контрольовані операції - 301-306</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодИсточника</name>
      <comment>Додаток 8 порядку складання звіту про контрольовані операції - 401-409</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОбычнаяРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКорректировкиДоходов</name>
      <comment>(+)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКорректировкиРасходов</name>
      <comment>(-)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательРентабельности</name>
      <comment>410-480</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяРентабельности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакГруппировкиВСовокупность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсследуемаяСторона</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусКонтрагента</name>
      <comment>Истина - поставщик, Ложь - покупатель</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСогласноКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СуммыВсехОпераций</name>
    <attributes>
      <name>Контрагент</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОперацийЗаПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РП/src/Documents/СведенияОКонтролируемыхОперациях/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ТекстОтраженияВРеглУчетеУКР() Экспорт
	
КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц, 
// необходимых для отражения в регламетированном учете
//
Функция ТекстЗапросаВТОтраженияВРеглУчетеУКР() Экспорт
	
	ТекстЗапроса = "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка как Ссылка,
	|	ДанныеДокумента.Дата как Период,
	|	ДанныеДокумента.Организация КАК Организация
	|ИЗ
	|	Документ.СведенияОКонтролируемыхОперациях КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
    |";
    
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
    
	Запрос.УстановитьПараметр("Период",         Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",    Реквизиты.Организация);
	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
    
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
    
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
    ТекстЗапросаТаблицаКонтролируемыеОперации(Запрос, ТекстыЗапроса, Регистры);
    ТекстЗапросаТаблицаОбщиеСведенияОКонтролируемыхОперациях(Запрос, ТекстыЗапроса, Регистры);
	
	////////////////////////////////////////////////////////////////////////////
	// Поместим результаты запроса в дополнительные свойства
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаКонтролируемыеОперации(Запрос, ТекстыЗапроса, Регистры)
    
	ИмяРегистра = "КонтролируемыеОперации";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	КонтролируемыеСделки.Контрагент,
	|	КонтролируемыеСделки.ДокументИнформационнйБазы,
	|	КонтролируемыеСделки.ДоговорКонтрагента,
	|	КонтролируемыеСделки.КодНаименованияОперации,
	|	КонтролируемыеСделки.ПредметСделки,
	|	КонтролируемыеСделки.ХарактеристикаНоменклатуры,
	|	КонтролируемыеСделки.ПредметСделкиСтрока,
	|	КонтролируемыеСделки.КодПредмета,
	|	КонтролируемыеСделки.КодКлассификатораПродукцииИУслуг,
	|	КонтролируемыеСделки.КодУКТВЭД,
	|	КонтролируемыеСделки.КодУКВЭП,
	|	КонтролируемыеСделки.ДатаКонтракта,
	|	КонтролируемыеСделки.НомерКонтракта,
	|	КонтролируемыеСделки.КодСтороныОперации,
	|	КонтролируемыеСделки.КодСтраныПроисхождения,
	|	КонтролируемыеСделки.УсловиеПоставкиПоИнкотермс,
	|	КонтролируемыеСделки.МестоПоставкиПоИнкотермс,
	|	КонтролируемыеСделки.ТорговаяМарка,
	|	КонтролируемыеСделки.Производитель,
	|	КонтролируемыеСделки.ДатаОперацииС,
	|	КонтролируемыеСделки.ДатаОперацииПо,
	|	КонтролируемыеСделки.ЦенаВал,
	|	КонтролируемыеСделки.КоличествоУпаковок КАК Количество,
	|	КонтролируемыеСделки.КоличествоСогласноКонтракта,
	|	КонтролируемыеСделки.КодВалюты,
	|	КонтролируемыеСделки.КурсВалюты,
	|	КонтролируемыеСделки.СуммаРегл,
	|	КонтролируемыеСделки.ЦенаРегл,
	|	КонтролируемыеСделки.КодОснования,
	|	КонтролируемыеСделки.КодМетода,
	|	КонтролируемыеСделки.КодИсточника,
	|	КонтролируемыеСделки.ЦенаОбычнаяРегл,
	|	КонтролируемыеСделки.СуммаКорректировкиДоходов,
	|	КонтролируемыеСделки.СуммаКорректировкиРасходов,
	|	КонтролируемыеСделки.ПоказательРентабельности,
	|	КонтролируемыеСделки.ЗначениеПоказателяРентабельности,
	|	КонтролируемыеСделки.ПризнакГруппировкиВСовокупность,
	|	КонтролируемыеСделки.ИсследуемаяСторона,
	|	КонтролируемыеСделки.Упаковка,
    |	ВЫБОР КОГДА КонтролируемыеСделки.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
    |		КонтролируемыеСделки.ПредметСделки.ЕдиницаИзмерения.Код
    |	КОГДА КонтролируемыеСделки.Упаковка.Код = """" ТОГДА
    |		КонтролируемыеСделки.Упаковка.ЕдиницаИзмерения.Код
    |	ИНАЧЕ
    |		КонтролируемыеСделки.Упаковка.Код
    |	КОНЕЦ КАК КодЕдиницыИзмерения,
    |	ВЫБОР КОГДА КонтролируемыеСделки.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) ТОГДА
    |		КонтролируемыеСделки.ПредметСделки.ЕдиницаИзмерения
    |	ИНАЧЕ
    |		КонтролируемыеСделки.Упаковка
    |	КОНЕЦ КАК ЕдиницаИзмерения,
	|	КонтролируемыеСделки.СтатусКонтрагента
	|ИЗ
	|	Документ.СведенияОКонтролируемыхОперациях.КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО НомерСтроки
	|";
	
    ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаОбщиеСведенияОКонтролируемыхОперациях(Запрос, ТекстыЗапроса, Регистры)
    
	ИмяРегистра = "ОбщиеСведенияОКонтролируемыхОперациях";
	
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
    КонецЕсли;
	
	ТекстЗапроса = 
	"
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	КонтролируемыеСделки.Контрагент,
	|	СУММА(КонтролируемыеСделки.СуммаРегл) КАК СуммаКонтролируемыхОпераций,
	|	0 КАК СуммаОбщая
	|ИЗ
	|	Документ.СведенияОКонтролируемыхОперациях.КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	&Организация,
	|	СуммыВсехОпераций.Контрагент,
	|	0,
	|	СУММА(СуммыВсехОпераций.СуммаОперацийЗаПериод)
	|ИЗ
	|	Документ.СведенияОКонтролируемыхОперациях.СуммыВсехОпераций КАК СуммыВсехОпераций
	|ГДЕ
	|	СуммыВсехОпераций.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыВсехОпераций.Контрагент";
	
    ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	ВводНаОснованииПереопределяемый.ДобавитьКомандуСоздатьНаОснованииБизнесПроцессЗадание(КомандыСоздатьНаОсновании);
	
	ВводНаОснованииПереопределяемый.ДобавитьКомандыСоздатьНаОснованииПисмаПоШаблону(КомандыСоздатьНаОсновании);
	
КонецПроцедуры

#КонецОбласти

#Область Отчеты

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти

#Область ИнициализацияИЗаполнение

Функция ЗаполнитьЗаПериод(Объект) Экспорт 
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьПоОстаткам

#КонецОбласти

#КонецОбласти

#КонецЕсли
